BUTTONS_MAIN_MENU = {"Как пользоваться": "How to use",
                     "Упражнения": "Exercises",
                     "Книги на английском": "Books in English",
                     "Рейтинг участников": "Participant's rating",
                     "Учить слова": "Learn words",
                     "Напоминания": "Notifications",
                     "Обратная связь": "Feedback"}


MAIN_MENU_BUTTONS_CONTENT = {
    "How to use": "Я помогу Вам в изучении английского языка. Регулярно уделяйте занятиям небольшой отрезок своего "
                  "времени и результат не заставит себя долго ждать!\nСо мной можно учить слова методом интервальных "
                  "повторений, выполнять упражнения на грамматику, читать книги различного уровня сложности и многое "
                  "другое. Скорее начинай 🤗",
    "Exercises": "Вы можете выбрать множество упражнений для проработки различных навыков. Нажмите на кнопку "
                  "с упражнением чтобы ознакомиться подробнее с каждым упражнением ⬇️",
    "Books in English": "Выбери интересующую книгу из списка и начинай читать:",
    "Participant's rating": "Каждое пройденное упражнение и выученное слово добавляет очки в твою копилку. "
                            "Здесь ты можешь узнать, каких высот ты достиг по сравнению с другими учащимися",
    "Learn words": "Добавляй слова в словарь, включай напоминания и я буду тебе подсказывать, когда пришло время их "
                   "повторять",
    "Notifications": "Здесь ты можешь включить напоминания",
    "Feedback": "Вы можете связаться с нами через Телеграм @DavidVarvashtyan, написать на почту mail@mail.ru",
}
